{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_2","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,8,8,13],"dtype":"float32","sparse":false,"name":"input1"}},{"class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,8],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true}},{"class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,8],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU2","trainable":true}},{"class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,8],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU3","trainable":true}},{"class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,8],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"additional_c1","trainable":true,"batch_input_shape":[null,8,8,32],"dtype":"float32"}},{"class_name":"LeakyReLU","config":{"alpha":0.3,"name":"additional_lr1","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true}},{"class_name":"Dense","config":{"units":2048,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"additional_d1","trainable":true}},{"class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}]},"keras_version":"tfjs-layers 3.12.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[8,8,13,32],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[8,8,32,32],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[8,8,32,32],"dtype":"float32"},{"name":"additional_c1/kernel","shape":[8,8,32,64],"dtype":"float32"},{"name":"additional_d1/kernel","shape":[4096,2048],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[2048,512],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[512,256],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[256,1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.12.0","convertedBy":null}