{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,8,8,38],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,8],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU1","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU3","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,8],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU1",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU3",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU2","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU4","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU2",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU4",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}],["flatten_Flatten2",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":134,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense3",0,0]]},"keras_version":"tfjs-layers 3.13.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[8,8,38,64],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[5,5,38,64],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[8,8,64,128],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[5,5,64,128],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[16384,1024],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[1024,512],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[512,134],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.13.0","convertedBy":null}