{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,8,8,38],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":13,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,8],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU1","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,8],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU2","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU2",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense2",0,0]]},"keras_version":"tfjs-layers 3.13.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[8,8,38,13],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[8,8,13,32],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[2048,64],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[64,1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.13.0","convertedBy":null}